# ============================================================
# Brewfile - macOS 개발 환경 패키지 선언
# 사용법: brew bundle --file=Brewfile
# ============================================================

# --- Homebrew Taps ---
tap "homebrew/bundle"

# --- CLI 도구 (brew) ---

# 기본
brew "git"
brew "mas"                  # Mac App Store CLI

# 터미널 생산성
brew "fzf"                  # 퍼지 파인더
brew "zoxide"               # 스마트 cd (z)
brew "bat"                  # cat 대체 (syntax highlighting)
brew "eza"                  # ls 대체 (아이콘, 컬러, Git 상태)
brew "ripgrep"              # grep 대체 (초고속 검색)
brew "fd"                   # find 대체 (초고속 파일 검색)
brew "jq"                   # JSON 파서
brew "yq"                   # YAML 파서
brew "htop"                 # 시스템 모니터
brew "gh"                   # GitHub CLI
brew "lazygit"              # Git TUI
brew "lazydocker"           # Docker TUI
brew "git-delta"            # Git diff 뷰어 (syntax highlighting)
brew "tldr"                 # 명령어 도움말 (man 대체)
brew "wget"                 # HTTP 다운로드
brew "tree"                 # 디렉토리 구조 표시
brew "trash"                # 파일을 휴지통으로 이동 (rm 대체)
brew "watch"                # 명령어 반복 실행

# Kubernetes
brew "kubectl"
brew "kubectx"              # context/namespace 빠른 전환
brew "k9s"                  # Kubernetes TUI

# 언어 버전 관리
brew "pyenv"                # Python 버전 관리
brew "nvm"                  # Node.js 버전 관리

# --- GUI 앱 (cask) ---

# 터미널
cask "iterm2"

# 브라우저
cask "google-chrome"
cask "arc"

# 생산성
cask "notion"
cask "raycast"

# 개발 도구
cask "visual-studio-code"
cask "jetbrains-toolbox"
cask "rancher"              # Docker/Kubernetes
cask "openlens"             # Kubernetes IDE

# 시스템 유틸리티
cask "rectangle"            # 윈도우 관리
cask "lunar"                # 모니터 밝기
cask "scroll-reverser"      # 마우스 스크롤 방향
cask "jordanbaird-ice"      # 메뉴바 관리
cask "keka"                 # 압축 해제
cask "karabiner-elements"   # 키 리매핑

# --- Mac App Store (mas) ---
mas "Clop", id: 1516295283
mas "Next Meeting", id: 1520163534
